ПредопределенныеЗначенияПодсистема/src/Catalogs/ПредопределенныеНастройки/ПредопределенныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредопределенныеНастройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенияПредопределенныхЗначений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПредопределенныеЗначенияПодсистема/src/CommonModules/ПредопределенныеНастройкиПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение предопределенной настройки по ее имени.
//
// Параметры:
//   ИмяНастройки - Строка - имя предопределенной настройки
//   ВызыватьИсключение - Булево - признак вызова исключения при отсутствии настройки
//
// Возвращаемое значение:
//   Произвольный - значение предопределенной настройки или результат для отсутствующей настройки
Функция Значение(ИмяНастройки, ВызыватьИсключение = Ложь) Экспорт
	
	РезультатЗначение = ПредопределенныеНастройки.ЗначениеПредопределеннойНастройкиПоИмени(ИмяНастройки, ВызыватьИсключение);
	
	Если РезультатЗначение = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
		Возврат ПредопределенныеНастройки.РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	ИначеЕсли РезультатЗначение = Неопределено Тогда
		Возврат ПредопределенныеНастройки.РезультатДляОтсутствующейНастройки(ИмяНастройки, ВызыватьИсключение);
	КонецЕсли;
	
	Возврат РезультатЗначение;
	
КонецФункции

// Возвращает ссылку на предопределенную настройку по ее имени.
//
// Параметры:
//   ИмяНастройки - Строка - имя предопределенной настройки
//
// Возвращаемое значение:
//   СправочникСсылка.ПредопределенныеНастройки, Неопределено - ссылка на найденную предопределенную настройку или Неопределено, если настройка не найдена
Функция СсылкаПредопределеннойНастройки(ИмяНастройки) Экспорт
	
	Возврат Справочники.ПредопределенныеНастройки.НайтиПоРеквизиту("ИмяНастройки", ИмяНастройки);
	
КонецФункции

#КонецОбласти
